
{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "Hey", "Is anyone there?", "Hello", "Hay", "What's up"],
     "responses": ["Hello", "Hi", "Hi there", "Howdy, partner", "How's it hanging, my new human friend?"]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye"],
     "responses": ["See you later", "Have a nice day", "Bye! Come back again"]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!"]
    },
    {"tag": "returnthanks",
    "patterns": ["I am well thank you! How are you?", "I am good and you", "Things are going well and your self?", "How are you?"],
    "responses": ["I'm doing great. Just chilling looking at flight deals", "I am groovy, my friend. Can we help you find some flights?", "I'm good—just drowning in vacation deals right now. Can I help you find one?"]
    },
    {"tag": "about",
     "patterns": ["Who are you?", "What are you?", "Who you are?" ],
     "responses": ["I'm FOX, your bot assistant", "I'm FOX, an Artificial Intelligence bot"]
    },
    {"tag": "name",
    "patterns": ["what is your name", "what should I call you", "whats your name?"],
    "responses": ["You can call me FOX.", "I'm FOX!", "Just call me FOX"]
    },
    {"tag": "help",
    "patterns": ["Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need a support", "I need a help", "support me please"],
    "responses": ["Of course. What would you like assistance with?", "I'm here to help you book your next dream vacation.", "Yes Sure, How can I support you in deciding where to travel next","I can easily help you choose where to go next"]
    },
    {"tag": "trip",
    "patterns": ["I wanna book a flight", "I want to get away", "I want to take a holiday", "can you show me some potential trips", "Are there any holiday deals", "I would like to book a flight.", "I'm trying to fly to"],
    "responses": ["let's figure out what type of get away your looking for, adventure, some R&R, or a site seeing trip", "What kind of holiday are you looking for? Adventure, relaxation, or site seeing?", "Are you looking to explore, get a tan, or experience the culture?"]
    },
    {"tag": "adventure",
    "patterns": ["I'd like to go explore","I want to adventure and see the outdoors","adventure"],
    "responses": ["I love to explore, too. Would you prefer a hot or cold climate?", "Oooh great idea, time to get that camera ready! Do you like hot or cold temperatures for your trip?"]
    },
    {"tag": "relax",
    "patterns": ["I want to sit by a beach", "I want to enjoy a book by the beach", "Some time to unwind and relax","I want to relax", "I'd like to go somewhere warm.", "I'd like to be somewhere warm."],
    "responses": ["Rest and relaxation—a little R&R. Somewhere hot? Or cooler, perhaps?"]
    },
    {"tag": "culture",
    "patterns": ["I want to experience the culture", "I want to meet the locals, learn their customs", "Maybe try some new foods and experience the culture of the country"],
    "responses": ["Chef's kiss to some beautiful food and people. Do you have a preference on climate?", "Ooooh I like it—try new things and meet new people. Does being in a hot place matter much to you?"]
    },
    {"tag": "hot",
    "patterns": ["I like it warm", "I want to sweat", "I like the heat", "I don't like the cold", "somewhere hot", "somewhere I can tan"],
    "responses": ["Perfect. How about the British Virgin Islands, specifically Tortolla? Also, one way or round trip?", "What about a trip to Tulum? Also, are you thinkin one way or round trip?", "Soak up the rays in the south of Italy. Whatcha thinking, one way or round trip?", "Why not stay in North America and hit the Hawian Islands! Also, would you like a one way or round trip?"]
    },
    {"tag": "no_temp",
    "patterns": ["I dont mind either warm or cold", "I can handle any climate", "Temperature is not a priority", "somewhere temporate", "I like an in between", "Doesn't matter", "I don't care"],
    "responses": ["Why not explore Osaka Japan? I hear the food is killer. Also, would you like a one way or round trip?", "Take a tour in Paris and see the Louvre... Whatcha think, one way or round trip?", "Try out the slots in Atlanta Georgia! Whatcha thinking, one way or round trip?", "How about hiking through the Scottish isles. Whatcha think, one way or round trip?"]
    },
    {"tag": "cold",
    "patterns": ["I like the cold", "I don't like the heat", "I want to enjoy the winter somewhere", "I like winter activities", "the cold is my happy place"],
    "responses": ["Why not a ski-cation at BigWhite in Canada, I hear the slopes are knarly. Also are you thinkin one way or round trip?", "Take a tour of Alaska and sled with the huskies! Round trip flight or one way my friend? ", "How about trying a new culture and heading to vienna to experience the art and food! whatcha thinking one way or round trip?", "Why not explore the natural beauty that Reykajavik has to offer! Maybe stay a while and book one way!"]
    },
    {"tag": "oneway",
    "patterns": ["I was hoping to go one way", "I don't want a return flight", "I want a one way flight", "one way", "oneway"],
    "responses": ["Amazing. We can easily find you a killer one way flight. When would you like to leave? Enter confirm to continue booking", "Ooh extended vacation!! I like it. We will set your booking to one way. Do you have a date in mind? Enter confirm to continue booking", "Talk about a new adventure! One way it is, my friend! When would you like to fly out? Enter confirm to continue booking", "One way eh? Nice, we've got that saved. When are you thinking about leaving? Enter confirm to continue booking"]
    },
    {"tag": "roundtrip",
    "patterns": ["I want my flight to be round", "round", "I want a return flight", "I can't holiday forever", "No, round"],
    "responses": ["We can find you both a return and departure! When are the dates you're interested in? Enter confirm to continue booking", "Yeah, I totally understand, when are you thinking for both departure and return times? Enter confirm to continue booking", "Roger, Roger. What dates are you thinking? Enter confirm to continue booking"]
    }
   
]
}